13/data/attachments/4aaa36d209112c6f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_foreign_Friend_60435_4</nif:username>
            <nif:friendToBeRequested>soap_friends_bcde9c55-436a-4e41-8d8d-46f647aec26f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>